{
    "news": [
        {
            "title": "Verze 2023.18",
            "perex": "Verze 2023.18 je zaměřen na integraci kódu původní verze 8. Zrušena je možnost přepnutí do staré verze 8 odstraněny jsou části kódu, které jsou již předělány do nového designu, nebo nejsou nadále podporovány.",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_202318"
        },
        {
            "title": "Verze 2023.0",
            "perex": "Verze 2023.0 je shodná s verzí 2022.52",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_20230"
        },
        {
            "title": "Verze 2022.52",
            "perex": "WebJET verze 2022.52 je zaměřen na zlepšení použitelnosti, obsahuje vylepšení na základě připomínek uživatelů. Předělány do nového designu jsou aplikace Anketa, definování atributů, Kontrola odkazů a prázdných stránek, Statistika, Rezervace. Aplikace Banner přidává možnost použití volitelných polí, v galerii je řada drobných zlepšení.",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_202252"
        },
        {
            "title": "Verze 2022.40",
            "perex": "2022.40 se zaměřuje na zlepšení bezpečnosti. Obsahuje aktualizované Java i JavaScript knihovny a zkontrolované zranitelnosti. Přináší ale i řadu jiných změn pro zlepšení práce na základě zpětné vazby - zapamatování poslední složky ve web stránkách, pamatování pořadí sloupců a uspořádání v data tabulkách, možnost posouvat okno atp. Jemně upravuje design uživatelského rozhraní (novější sada ikon, jemnější barevnost menu).",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_202240"
        },
        {
            "title": "Verze 2022.18",
            "perex": "2022.18 přidává integraci nástroje PageBuilder do web stránek, možnost používat designové šablony psané ve frameworku Thymeleaf, zobrazení posledních zpráv v logu, mnohá zlepšení použitelnosti na základě připomínek uživatelů, předělané aplikace Formuláře - regulární výrazy, Hromadný email - odhlášené emaily. Na úvodní stránku přidány mini aplikace Záložky a zpětná vazba.",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_202218"
        },
        {
            "title": "Verze 2022.0",
            "perex": "2022.0 přináší bezpečnostní aktualizaci závislostí Java a JavaScript knihoven.",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_20220"
        },
        {
            "title": "Verze 2021.52",
            "perex": "2021.52 má nový design i pro staré verze aplikací, zlepšuje responzivní verzi, přidává nová pole web stránkám a zlepšuje chování URL adres stránek při jejich přesunu do jiného adresáře.",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202152"
        },
        {
            "title": "Verze 2021.47",
            "perex": "2021.47 přidává upravené aplikace Tooltip, Export dat, Hromadný-email/Doménové limity a Bannerový systém do nového designu. Přidali jsme notifikace o schvalování při uložení stránky a zlepšili mobilní verzi.",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202147"
        },
        {
            "title": "Verze 2021.45",
            "perex": "2021.45 přináší zobrazení seznamu web stránek i z podadresářů, zlepšuje zobrazení administrace na mobilních zařízeních a přidává aplikaci Otázky a odpovědi. Kromě toho obsahuje mnoho změn pod kapotou při práci se seznamem web stránek (přechod na serverové stránkování a vyhledávání, použití Spring DATA pro přístup k databázi).",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202145"
        },
        {
            "title": "Verze 2021.40",
            "perex": "2021.40 přináší předělanou správu uživatelů, skupin a skupin práv a předělanou aplikaci GDPR do vizuálu WebJET 2021. Kromě toho přidává množství drobných vylepšení a oprav.",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202140"
        },
        {
            "title": "Verze 2021.24",
            "perex": "2021.24 přidává možnost duplikovat záznamy v data tabulkách, automatické otevření kořenových adresářů pokud doména obsahuje např. jen adresář Česky a Anglicky (max. 2 adresáře), umožňuje provádět hromadnou úpravu ve web stránkách a zlepšuje ve více místech komfort práce. ",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202124"
        },
        {
            "title": "Verze 2021.20",
            "perex": "2021.20 přidává zobrazení a konfiguraci volitelných polí pro web stránku a adresář stránek a přidává (konečně) tlačítko pro zobrazení web stránky do nástrojové lišty datatabulky.",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202120"
        },
        {
            "title": "Verze 2021.18",
            "perex": "2021.18 automaticky vytvoří doménovou System složku, přidává editaci značek (perex skupin), vylepšuje chování editace buňky a opravuje chybu zobrazení číselníkových hodnot v datatabulce. Administrace používá nové písmo Asap.",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202118"
        },
        {
            "title": "Verze 2021.13",
            "perex": "2021.13 zlepšuje uživatelský zážitek zvýšením rychlosti zobrazení seznamu web stránek, možnost zadat ID stránky nebo adresáře pro její zobrazení (včetně zapamatování v URL adrese prohlížeče), možnost nastavení zobrazených sloupců v datatabulce, překlady v JavaScript souborech a množství dalších vylepšení v celém WebJETu.",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202113"
        },
        {
            "title": "Verze 2021.11",
            "perex": "2021.11 přidává zobrazení historie web stránky s možností editace, zobrazení a porovnání.",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202111"
        },
        {
            "title": "Verze 2021.10",
            "perex": "2021.10 opravuje chybu velikosti dialogového okna v editoru stránek a opravuje několik gramatických chyb v popisech aplikací.",
            "link": "http://docs.webjetcms.sk/v2021/#/CHANGELOG?id=_202110"
        }
    ]
}