{
    "news": [
        {
            "title": "Verzia 2024.18",
            "perex": "WebJET 2024.18 obsahuje **novú sadu ikon**, Formulár ľahko doplnený o **pokročilé nastavenia** (príjemcovia, presmerovania...), do nového dizajnu sú prerobené aplikácie AB Testovanie, Audit (čaká na publikovanie, zmenené stránky), Blog, Dotazníky, Kalendár udalostí (schvaľovanie). Pridáva **podporu inštalácie typu MultiWeb** (oddelenie údajov domén) v Šablónach, Hromadnom e-maile a ďalších aplikáciách. Nová knižnica na **detekciu prehliadačov**, v Štatistika-Prehliadače dôjde k drobným rozdielom, ale údaje o prehliadači anonymizovane zaznamenávame aj bez Cookies súhlasu.",
            "link": "http://docs.webjetcms.sk/latest/sk/CHANGELOG-2024?id=_202418"
        },
        {
            "title": "Verzia 2024.0",
            "perex": "WebJET 2024.0 je zhodná s verziou 2023.52",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_202352"
        },{
            "title": "Verzia 2023.52",
            "perex": "WebJET 2023.52 obsahuje novú verziu **aktualizácie s opisom zmien**, **klonovanie štruktúry** integrované s funkciou zrkadlenia (vrátane možnosti prekladov), pridáva možnosť **obnoviť** web stránku, alebo **celý priečinok z koša**, pridáva **editor typu HTML** a možnosť nastavenia typu editora priamo pre šablónu, **aplikáciam** je možné **zapnúť zobrazenie len pre zvolené typy zariadení** mobil, tablet, PC a samozrejme zlepšuje bezpečnosť a komfort práce.",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_202352"
        },{
            "title": "Verzia 2023.40",
            "perex": "Verzia 2023.40 pridáva možnosť **vyhľadávania v prieskumníku**/súboroch, možnosť použiť **video banner**, zlepšuje používateľské rozhranie, zrýchľuje načítanie dát vo web stránkach. **Banner** pridáva nastavenia obmedzení pre **zobrazenie len v zadaných web stránkach a priečinkoch**. Nová aplikácia **HTTP hlavičky** umožňuje nastavovať HTTP hlavičky pre zadané URL adresy. **Médiám** sme pridali **voliteľné polia**. Zrkadlenie štruktúry podporuje **preklad aj tela web stránky** a zlepšuje detekciu zmien. Do nového dizajnu prerobené aplikácie **Monitorovanie servera, SEO, Novinky, Diskusia**.",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_202340"
        },{
            "title": "Verzia 2023.18",
            "perex": "Verzia 2023.18 je zameraná na integráciu kódu pôvodnej verzie 8. Zrušená je možnosť prepnutia do starej verzie 8, odstránené sú časti kódu, ktoré sú už prerobené do nového dizajnu, alebo nie sú naďalej podporované.",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_202318"
        },
        {
            "title": "Verzia 2023.0",
            "perex": "Verzia 2023.0 je zhodná s verziou 2022.52",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_20230"
        },
        {
            "title": "Verzia 2022.52",
            "perex": "Verzia 2022.52 je zameraná na zlepšenie použiteľnosti, obsahuje vylepšenia na základe pripomienok používateľov. Prerobené do nového dizajnu sú aplikácie Anketa, definovanie atribútov, Kontrola odkazov a prázdnych stránok, Štatistika, Rezervácie. Aplikácia Banner pridáva možnosť použitia voliteľných polí, v galérii je množstvo drobných zlepšení.",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_202252"
        },
        {
            "title": "Verzia 2022.40",
            "perex": "2022.40 sa zamieriava na zlepšenie bezpečnosti. Obsahuje aktualizované Java aj JavaScript knižnice a skontrolované zraniteľnosti. Prináša ale aj množstvo iných zmien pre zlepšenie práce na základe spätnej väzby - zapamätanie posledného priečinka vo web stránkach, pamätanie poradia stĺpcov a usporiadania v data tabuľkách, možnosť posúvať okno atď. Jemne upravuje dizajn používateľského rozhrania (novšia sada ikon, jemnejšia farebnosť menu).",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_202240"
        },
        {
            "title": "Verzia 2022.18",
            "perex": "2022.18 pridáva integráciu nástroja PageBuilder do web stránok, možnosť používať dizajnové šablóny písané vo frameworku Thymeleaf, zobrazenie posledných správ v logoch, mnohé zlepšenia použiteľnosti na základe pripomienok používateľov, prerobené aplikácie Formuláre - regulárne výrazy, Hromadný email - odhlásené emaily. Na úvodnú stránku pridané mini aplikácie Záložky a spätná väzba.",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_202218"
        },
        {
            "title": "Verzia 2022.0",
            "perex": "2022.0 prináša bezpečnostnú aktualizáciu závislostí Java a JavaScript knižníc.",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_20220"
        }
    ]
}