{
    "news": [
        {
            "title": "Version 2024.40",
            "perex": "In version 2024.40 Explorer brings **confirmation when moving files drag&drop**, which reduces the risk of errors. The image editor allows **sizing and cropping according to templates**, making editing easy. The settings of several **applications** have been reworked into a **new design**. The author of the page receives **notifications at the time of publishing and adding a post** to the forum. The new booking application allows **easy booking of objects** and offers statistics for better management. We improved PageBuilder and fixed bugs in File Archive for better stability.",
            "link": "http://docs.webjetcms.sk/latest/en/CHANGELOG-2024?id=_202440"
        },
        {
            "title": "Version 2024.18",
            "perex": "WebJET 2024.18 contains a **new set of icons**, Form easily supplemented with **advanced settings** (recipients, redirects...), applications AB Testing, Audit (awaiting publication, changed pages), Blog, Questionnaires, Calendar of events (approval). Adds **MultiWeb installation support** (separation of domain data) in Templates, Bulk Email and other applications. New library for **browser detection**, there will be minor differences in Statistics-Browsers, but we record browser data anonymously even without Cookies consent.",
            "link": "http://docs.webjetcms.sk/latest/en/CHANGELOG-2024?id=_202418"
        },
        {
            "title": "Version 2024.0",
            "perex": "WebJET version 2024.0 is identical to version 2023.52",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_202352"
        },
        {
            "title": "Version 2023.52",
            "perex": "WebJET version 2023.52 contains a new version of **update with description of changes**, **structure cloning** integrated with the mirroring function (including the possibility of translations), adds the option to **restore** the website, or **the entire folder from the trash**, adds **HTML type editor** and the option to set the editor type directly for the template, **applications** can **turn on display only for selected types of devices** mobile, tablet, PC and of course improves safety and comfort of work.",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_202352"
        },{
            "title": "Version 2023.40",
            "perex": "Version 2023.40 adds **search in explorer**/files, possibility to use **video banner**, improves user interface, speeds up data loading in web pages. **Banner** adds restriction settings for **display only in specified web pages and folders**. The new **HTTP headers** application allows you to set HTTP headers for specified URLs. We added **optional fields** to **Media**. Mirroring the structure supports **translation of both the web page body** and improves change detection. Redesigned applications **Server monitoring, SEO, News, Discussion**.",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_202340"
        },
        {
            "title": "Version 2023.18",
            "perex": "Version 2023.18 is focused on the integration of the original version 8 code. Deprecated is the option to switch to the old version 8 parts of the code that have already been redesigned or are no longer supported have been removed.",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_202318"
        },
        {
            "title": "Version 2023.0",
            "perex": "Version 2023.0 is identical to version 2022.52",
            "link": "http://docs.webjetcms.sk/v2023/#/CHANGELOG-2023?id=_20230"
        },
        {
            "title": "Version 2022.52",
            "perex": "WebJET version 2022.52 is focused on usability improvement, includes improvements based on user feedback. The applications Survey, defining attributes, Checking links and empty pages, Statistics, Reservations have been redesigned in a new design. The Banner application adds the possibility of using custom fields, there are many small improvements in the gallery.",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_202252"
        },
        {
            "title": "Version 2022.40",
            "perex": "2022.40 aims to improve security. Contains updated Java and JavaScript libraries and scanned for vulnerabilities. It also brings a number of other changes to improve work based on feedback - remembering the last folder in web pages, remembering the order of columns and arrangement in data tables, the ability to move the window, etc. Subtly modifies the user interface design (newer set of icons, softer menu colors).",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_202240"
        },
        {
            "title": "Version 2022.18",
            "perex": "2022.18 adds the integration of the PageBuilder tool into web pages, the ability to use design templates written in the Thymeleaf framework, displaying the latest news in logos, many usability improvements based on user comments, redesigned applications Forms - regular expressions, Mass email - unsubscribed emails. Added bookmarks and feedback mini-apps to the home page.",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_202218"
        },
        {
            "title": "Version 2022.0",
            "perex": "2022.0 brings a security update to Java and JavaScript library dependencies.",
            "link": "http://docs.webjetcms.sk/v2022/#/CHANGELOG-2022?id=_20220"
        }
    ]
}